app/controllers/pictures_controller.rb

  def create
    @picture = Picture.new(picture_params)
    if @picture.save
---
INSERT INTO "pictures" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Mon, 04 Nov 2013 21:10:18 UTC +00:00], ["updated_at", Mon, 04 Nov 2013 21:10:18 UTC +00:00]]

  def edit
    @picture = Picture.find(params[:id])
---
SELECT "pictures".* FROM "pictures" WHERE "pictures"."id" = ? LIMIT 1  [["id", "4"]]

  def update
    @picture = Picture.find(params[:id])

    if @picture.update_attributes(picture_params)
---
SELECT "pictures".* FROM "pictures" WHERE "pictures"."id" = ? LIMIT 1  [["id", "11"]]
UPDATE "pictures" SET "artist" = ?, "title" = ?, "updated_at" = ? WHERE "pictures"."id" = 11  [["artist", "Gene"], ["title", "Coke!"], ["updated_at", Mon, 04 Nov 2013 21:46:06 UTC +00:00]]

  def destroy
    @picture = Picture.find(params[:id])

    @picture.destroy
---
SELECT "pictures".* FROM "pictures" WHERE "pictures"."id" = ? LIMIT 1  [["id", "8"]]
DELETE FROM "pictures" WHERE "pictures"."id" = ?  [["id", 8]]